Repository: amal-alfaifi/final-Project
Catalog: MyApp/Resources/*.lproj/Localizable.strings
Languages: ar

source: SIGN IN
ar: الدخول

source: email
ar: الايميل

source: password
ar: الرقم السري

source: Log In
ar: تسجيل الدخول

source: Sign up
ar: تسجيل

source: Don't have account?
ar: ليس لديك حساب؟ سجل الان

source: first
ar: الاسم الاول

source: last
ar: تأكيد الرقم السري

source: did you have account?
ar: لديك حساب؟

source: Abha
ar: ابها

source: kh
ar: خميس مشيط

source: u
ar: احد رفيده

source: m
ar: محايل عسير

source: services
ar: نوع الخدمه

source: Blood donation
ar: التبرع بالدم

source: Patient facilities
ar: مرافق مريض

source: Name
ar: الاسم

source: National Identity
ar: الهويه الوطنيه

source: blood type
ar: فصيلة الدم

source: Telephone number
ar: رقم الجوال

source: Search
ar: بحث

source: new donor
ar: متبرع جديد

source: Donor's name :
ar: ادخل اسم المتبرع

source: dddo
ar: اسم المتبرع

source: NDonor
ar: رقم الهويه

source: phDonor
ar: رقم الجوال

source: TDonor
ar: فصيلة الدم

source: sd
ar: جنسك

source: bd
ar: تاريخ الميلاد

source: Donorname
ar: ادخل اسم المتبرع

source: National
ar: ادخل رقم الهويه الوطنيه

source: Mobile number
ar: ادخل رقم الجوال

source: blood
ar: ادخل فصيلة الدم

source: Add
ar: اضافه

source: b
ar: فصيلتك مين تعطي؟

source: Hospital
ar: المستشفيات

source: Aseer central hospital
ar: مستشفى عسير المركزي

source: King faisal
ar: مدينة الملك فيصل الطبية

source: Uhud Rafidah
ar: مستشفى احد رفيدة العام

source: Mustasharak Hospital
ar: مستشفى مستشارك

source: German Hospital
ar: مستشفى الالماني

source: Saudi Specialist
ar: المركز الطبي التخصصي السعودي

source: Khamis Mushait
ar: مستشفى خميس مشيط العام

source: Mahayel
ar: مستشفى محايل عسير

source: age
ar: العمر

source: volunteer
ar: متطوع جديد

source: vname
ar: اسم المتطوع

source: vn
ar: رقم الهويه

source: vnum
ar: رقم الجوال

source: volunteer name
ar: ادخل اسم المتطوع

source: i
ar: : A+ يمكن أن يتم نقل هذه الفصيلة إلى فصائل الدم A موجب، أو AB موجب. : A- يمكن نقلها لأي شخص يحمل فصيلة الدم A أو AB. : B+ يمكن أن يتم التبرع بالدم من هذه الفصيلة لأي شخص لديه فصيلة الدم B موجب أو AB موجب. : B- يمكن نقل هذه الفصيلة من الدم لأي شخص يحمل فصيلة الدم B أو AB. : AB+ يمكن للشخص الذي يحمل هذه الفصيلة أخذ الدم أو البلازما من أي فصيلة أخرى، لذا يعرف حامل فصيلة AB موجب بالمستقبل العام. : AB- يمكن نقل هذه الفصيلة من الدم لأي شخص يحمل فصيلة الدم AB سالب، وAB موجب فقط. : O+ موجب: يمكن نقلها لأي شخص لديه فصيلة دم موجبة. : O- يمكن نقلها لأي فصيلة دم أخرى، لذا يعرف الشخص الذي يحمل هذه الفصيلة باسم المانح العام.

source: change languge
ar: تغيير اللغه

source: Sign out
ar: تسجيل الخروج

source: Organ donation
ar: التبرع بالأعضاء

source: name
ar: ادخل اسمك الثلاثي

source: The college
ar: الكلى

source: the heart
ar: القلب

source: the bones
ar: العظام

source: the lung
ar: الرئه

source: the g
ar: جنسك

source: bir
ar: تاريخ الميلاد

source: Policy and Terms
ar: السياسة والخصوصية

source: nam1
ar: الاسم

source: Dark mode
ar: الوضع الليلي

source: Do you want to donate organs after death?
ar: هل تريد التبرع بأعضائك بعد الوفاة ؟

source: Donate🫁
ar: تبـرع🫁

source: Yes
ar: نعم

source: No
ar: لا

source: Condition
ar: شرط

source: You must agree to the terms.
ar: يجب ان توافق على السياسة والخصوصية.

source: Cancle
ar: الغاء

source: Profile
ar: ملفي الشخصي

source: City
ar: المحافظه

source: lo
ar: الخريطة

source: E
ar: إخفاء الصورة الشخصية

source: gen
ar: الجنس

source: phN
ar: رقم الهاتف

source: Date of Birth
ar: تاريخ الميلاد

source: ALLOW
ar: Allow location

source: please enable location service
ar: السماح بالوصول الى موقعك

source: Search for a place or address
ar: البحث عن موقع

source: Enable Location
ar: تمكين الموقع
